Revit 2027 API
BoundaryConditions.CanCreatePointBoundaryConditions Method
 Checks if the provided host can host a point boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCreatePointBoundaryConditions(
	Document doc,
	Reference reference,
	bool isConstrainedOnHost,
	XYZ point
)
Public Shared Function CanCreatePointBoundaryConditions (
	doc As Document,
	reference As Reference,
	isConstrainedOnHost As Boolean,
	point As XYZ
) As Boolean
public:
static bool CanCreatePointBoundaryConditions(
	Document^ doc,
	Reference^ reference,
	bool isConstrainedOnHost,
	XYZ^ point
)
static member CanCreatePointBoundaryConditions :
        doc : Document *
        reference : Reference *
        isConstrainedOnHost : bool *
        point : XYZ -> bool
Parameters
doc Document
 The document containing both the host and the boundary conditions.
reference Reference
 A reference to an analytical element.
isConstrainedOnHost Boolean
 A value indicating if the point boundary conditions is constrained on host or not.
point XYZ
 Position of the boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Return Value
Boolean
 True if a point boundary conditions can be placed on the input host.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace